Tekla.Structures.ModelInternal.GeometryTree
The GeometryTree class represents the geometry tree object has.

Tekla.Structures.ModelInternal.GeometryTree.InvalidGeometryNodeId
An invalid geometry node id. This value is used e.g. as the parent index for the root node.

Tekla.Structures.ModelInternal.GeometryTree.#ctor(Tekla.Structures.Model.IGeometryNode)
Initializes a new instance of the GeometryTree class.
node: The node.

Tekla.Structures.ModelInternal.GeometryTree.Root
Gets or sets this geometry root.

Tekla.Structures.ModelInternal.GeometryTree.NodesById
Gets the list of nodes indexes in this geometry and the corresponding nodes

Tekla.Structures.ModelInternal.GeometryTree.Edges
Gets for a given node whose index is the key the indexes of the nodes which are its children in the Geometry

Tekla.Structures.ModelInternal.GeometryTree.NodesId
Gets or sets the list of nodes and their corresponding index.
Provided for convenience - Do not expose to prevent inconsistency with NodesById!

Tekla.Structures.ModelInternal.GeometryTree.NodeIdToParentId
Gets or sets the parent index in this geometry of the corresponding node.

Tekla.Structures.ModelInternal.GeometryTree._NodesById
the list of nodes indexes in this geometry and the corresponding nodes

Tekla.Structures.ModelInternal.GeometryTree._NodesId
the list of nodes and their corresponding index

Tekla.Structures.ModelInternal.GeometryTree.Clone
Creates a copy of this GeometryTree. Edges are new objects but Nodes are shared with the initial GeometryTree.
Returns: A copy of this

Tekla.Structures.ModelInternal.GeometryTree.GetNodeId(Tekla.Structures.Model.IGeometryNode)
Find the index associated to a given node.
node: the node whose index is queried
Returns: the node index in case of success, -1 in case of failure

Tekla.Structures.ModelInternal.GeometryTree.GetNodeByIndex(System.Int32)
Returns geometry node by geometry index.
index: the geometry node index
Returns: geometry node or null if provided index is invalid

Tekla.Structures.ModelInternal.GeometryTree.AddNode(Tekla.Structures.Model.IGeometryNode)
Adds a geometry primitive node to this GeometryTree.
node: The geometry primitive node to add.
Returns: index of the added node (root index is 0), or existing index if the node is already in this GeometryTree

Tekla.Structures.ModelInternal.GeometryTree.AddEdge(Tekla.Structures.Model.IGeometryNode,Tekla.Structures.Model.IGeometryNode)
Adds a connection between two geometry nodes in this GeometryTree.
If needed, the nodes are first added to this GeometryTree.
from: the source node
to: the connected node

Tekla.Structures.ModelInternal.GeometryTree.AddEdge(System.Int32,System.Int32)
Adds a connection between geometry primitives of this GeometryTree
fromIndex: Index of source primitive
toIndex: Index of connected primitive

Tekla.Structures.ModelInternal.GeometryTree.RemoveEdge(Tekla.Structures.Model.IGeometryNode,Tekla.Structures.Model.IGeometryNode)
Removes a connection between two geometry primitives of this GeometryTree
from: the source node
to: the connected node

Tekla.Structures.ModelInternal.GeometryTree.RemoveEdge(System.Int32,System.Int32)
Removes a connection between geometry primitives of this GeometryTree
fromIndex: Index of source primitive
toIndex: Index of connected primitive

Tekla.Structures.ModelInternal.GeometryTree.GetBranch(Tekla.Structures.Model.IGeometryNode)
Creates a new GeometryTree that is formed by the branch in this instance that starts at node.
node: the root of the branch
Returns: the branch in a new GeometryTree

Tekla.Structures.ModelInternal.GeometryTree.AddBranch(Tekla.Structures.ModelInternal.GeometryTree,Tekla.Structures.Model.IGeometryNode)
Adds to this GeometryTree the branch in branchSource that starts at branchRoot, who should be in both this and branchSource.
branchSource: Source of the branch to add
branchRoot: Node in branchSource that is the root of the branch to add

Tekla.Structures.ModelInternal.GeometryTree.RemoveBranch(Tekla.Structures.Model.IGeometryNode)
Removes the branch whose root is branchRoot.
branchRoot: Root of the branch to remove

Tekla.Structures.ModelInternal.GeometryTree.IsValidId(System.Int32)
Returns true if index is a valid node index.
index: the node index
Returns: true if the index is a valid node index

Tekla.Structures.ModelInternal.GeometryTree.GetChildren(Tekla.Structures.Model.IGeometryNode)
Retrieves the list of nodes which are directly connected to a given node
node: the source of connections
Returns: The list of nodes towards which there is an edge from node in the geometry

Tekla.Structures.ModelInternal.GeometryTree.GetParentNode(Tekla.Structures.Model.IGeometryNode)
Gets the parent node of node in the geometry tree.
node: the node whose parent is queried
Returns: the parent node of node in the tree, or null if node has no parent

Tekla.Structures.ModelInternal.GeometryTree.Split(System.Int32)
Returns the resulting disconnected geometries when removing from this geometry a node (of any type) and related automatic nodes.
nodeIndex: Index of the node to remove.
Returns: The resulting geometries once the node and related automatic nodes are removed.
Throws System.ArgumentException: Thrown when the supplied nodeIndex is invalid.

Tekla.Structures.ModelInternal.GeometryTree.IsTransitivelyConnectedTo(System.Int32,System.Int32)
Searches for a connected path between two nodes.
fromIndex: index of source node
toIndex: index of destination node
Returns: true if there is a connected path from fromIndex node to toIndex node, false otherwise

Tekla.Structures.ModelInternal.GeometryTree.GetGeometryTreeLeafSections
Gets end GeometrySections of the geometry which are possible to remove.
Returns: Returns list of leaf GeometrySections possible to remove.

Tekla.Structures.ModelInternal.GeometryTree.IsValidLeafToRemove(Tekla.Structures.Model.GeometrySection)
Returns true if its possible to remove geometrySection from geometry.
geometrySection: GeometrySection to remove.
Returns: True if its possible to remove, false otherwise.

Tekla.Structures.ModelInternal.GeometryTree.IsUserDefinedPolygonNode(Tekla.Structures.Model.IGeometryNode)
Returns whether node is a user defined polygon node
node: the queried node
Returns: true if node is a user defined polygon node

Tekla.Structures.ModelInternal.GeometryTree.RemoveNode(Tekla.Structures.Model.IGeometryNode)
Removes node from the geometry.
node: Node to remove.

Tekla.Structures.ModelInternal.GeometryTree.RemoveNode(System.Int32)
Removes node from the geometry.
nodeId: Node id to remove.

Tekla.Structures.ModelInternal.GeometryTree.FindFirstUserPolygonsChildren(Tekla.Structures.Model.IGeometryNode)
Returns the first user-defined polygon node that is found in each branch when traversing the tree down from node,
ignoring node if it's a user-defined polygon itself
node: the node where to start searching for user defined polygon node(s)
Returns: the user-defined polygon node or nodes if several branches were found

Tekla.Structures.ModelInternal.GeometryTree.FindBendNodeConnection(Tekla.Structures.Model.IGeometryNode,Tekla.Structures.Model.IGeometryNode)
Finds common line segments between bend surface node and polygon node.
node1: The first node is BendSurfaceNode.
node2: The second node is PolygonNode.
Returns: Line segments connecting bend and polygon nodes.

Tekla.Structures.ModelInternal.GeometryTree.findPolygonNodeConnection(Tekla.Structures.Model.PolygonNode,Tekla.Structures.Model.PolygonNode)
Finds common side boundaries between 2 polygon nodes.
node1: The first node.
node2: The second node.
Returns: Line segments connecting both polygon nodes.

Tekla.Structures.ModelInternal.GeometryTree.GetNeighborSections(System.Int32)
Gets neighbor sections of the node with nodeIndex index.
nodeIndex: Index of the node used to get its neighbors.
Returns: List of neighbor geometry sections of the given node index.

Tekla.Structures.ModelInternal.GeometryTree.GetConnection(System.Int32,System.Int32)
Returns 2 connecting line segments between node1Index and node2Index indexes, if nodes are connected, otherwise returns empty list.
node1Index: The first node index.
node2Index: The second node index.
Returns: 2 connecting line segments if nodes are connected, otherwise returns empty list.